Repository: BenasB/PUTS
Catalog: PUTSWeb/Resources/Views.Home.FAQ.*.resx
Languages: lt

source: Do other users see my results?
lt: Ar kiti vartotojai mato mano rezultatus?

source: FAQ
lt: DUK

source: Frequently asked questions
lt: Dažnai užduodami klausimai

source: How to start using PUTS?
lt: Kaip pradėti naudoti PUTS?

source: I found a problem/mistake in the system. What should I do?
lt: Radau sistemos problemą/klaidą. Ką man daryti?

source: I get 'Program timed out' error message. What should I do?
lt: Gaunu „Programa viršijo ribojimo laiką“ klaidos pranešimą. Ką daryti?

source: I have more questions. How can I contact you?
lt: Turiu daugiau klausimų. Kaip man susisiekti?

source: Is C++11 supported?
lt: Ar palaikoma C++11?

source: Make sure your program can be compiled on your machine. Check for missing semicolons, programming errors. The error message can help you.
lt: Įsitikinkite, kad programa susikompiliuoja jūsų įrenginyje. Patikrinkite ar netrūksta kabliataškių, nėra programavimo klaidų. Angliškas klaidos pranešimas gali padėti.

source: Only C/C++.
lt: Tik C/C++.

source: Only standard input is used. You get data like you get input from the console window, for example using cin.
lt: Tik standartinę įvestį. Pradinius duomenis gaunate taip pat, kaip gautumėte iš konsolės lango, pavyzdžiui naudojant cin.

source: Only you and administrators can see your results.
lt: Tik jūs ir administratoriai gali matyti jūsų rezultatus.

source: Report it to bud.benas@gmail.com
lt: Praneškite apie tai el. paštu bud.benas@gmail.com

source: Sign up and head to the problem list by clicking on 'Problems' tab in the navigation panel.
lt: Užsiregistruokite ir eikite į užduočių sąrašą, kurį galima pasiekti paspaudus „Uždaviniai“ navigacinėje panelėje.

source: This usually occurs when the program is stuck (for example waiting for an input when there is none) or takes too much time to run and needs optimisation.
lt: Įprastai taip atsitinka, kai programa tampa užstrigusi (pavyzdžiui laukia įvesties, nors ji nepateikiama) arba veikia per ilgai ir reikalinga jos optimizacija.

source: What programming languagues are supported?
lt: Kokios programavimo kalbos palaikomos?

source: What to do if the compilation failed?
lt: Ką daryti, jei kompiliacija nesėkminga?

source: What type of input do problems use?
lt: Kokia įvestį naudoja uždaviniai?

source: Yes.
lt: Taip.

source: You can send a message to bud.benas@gmail.com
lt: Jūs galite nusiųsti žinutę el. paštu bud.benas@gmail.com
