Repository: BenasB/PUTS
Catalog: PUTSWeb/Resources/Views.Home.Privacy.*.resx
Languages: lt

source: At PUTS, one of our main priorities is the privacy of our visitors. This Privacy Policy document contains types of information that is collected and recorded by PUTS and how we use it.
lt: Vienas iš PUTS prioritetų yra mūsų vartotojų privatumas. Šis privatumo politikos dokumentas nurodo informaciją, kurią renka ir naudoja PUTS.

source: By using our website, you hereby consent to our Privacy Policy and agree to its terms.
lt: Naudodamiesi mūsų tinklalapiu, jūs sutinkate su mūsų privatumo politika.

source: Children's Information
lt: Vaikų informacija

source: Consent
lt: Sutikimas

source: Cookies
lt: Slapukai

source: Develop new products, services, features, and functionality
lt: Vystyti naujus produktus, paslaugas ir funkcionalumą.

source: How we use your information
lt: Kaip mes naudojame jūsų informaciją

source: If you have additional questions or require more information about our Privacy Policy, do not hesitate to contact us at bud.benas@gmail.com
lt: Jei turite klausimų dėl mūsų privatumo politikos, susisiekite su mumis elektroniniu paštu bud.benas@gmail.com

source: Improve, personalize, and expand our website
lt: Tobulinti, personalizuoti ir plėtoti mūsų tinklalapį.

source: Information we collect
lt: Renkama informacija

source: Like any other website, PUTS uses 'cookies'. These cookies are used to store information about visitors' preferences. The information is used to optimize the users' experience.
lt: Kaip ir kiti tinklalapiai, PUTS naudoja „slapukus“. Šie slapukai naudojami kaupti informaciją apie lankytojo nustatymus. Ši informacija naudojama optimizuoti vartotojo patirčiai.

source: Privacy policy
lt: Privatumo politika

source: Privacy Policy for PUTS
lt: PUTS privatumo politika

source: Provide, operate, and maintain our website
lt: Pateikti, valdyti ir prižiūrėti mūsų tinklalapį.

source: PUTS does not knowingly collect any Personal Identifiable Information from children under the age of 13. If you think that your child provided this kind of information on our website, we strongly encourage you to contact us immediately and we will do our best efforts to promptly remove such information from our records.
lt: PUTS sąmoningai nerenka asmens duomenų iš vaikų, mažesnių nei 13 metų. Jei jūs manote, kad jūsų vaikas pateikė tokią informacija mūsų tinklalapiui, patariame jums nedelsiant susisiekti su mumis ir mes stengsimės šią informaciją panaikinti.

source: The personal information that you are asked to provide will be made clear to you.
lt: Asmeninė informacija, kurią prašysime jūsų pateikti, bus aiškiai nurodyta.

source: Understand and analyze how you use our website
lt: Suprasti ir analizuoti kaip jūs naudojate mūsų tinklalapį.

source: We use the information we collect in various ways, including to:
lt: Mes naudojame jūsų informaciją įvairiais būdais:

source: When you register for an Account, we may ask for your contact information.
lt: Registruojant paskyrą, mes galime prašyti jūsų kontaktinės informacijos.
